Tekla Open API Reference for Tekla Structures 2025
WpfProfileCatalog Methods
The WpfProfileCatalog type exposes the following members.
Methods
Name | Description
Dispose
 Cleans up any resources being used.
InitializeComponent
 InitializeComponent
OnValueChanged
 Event handler for passing generic catalog data back to dialog
Top
See Also
Reference
WpfProfileCatalog Class
Tekla.Structures.Dialog.UIControls Namespace